import math

side_1 = int(input("პირველი გვერდის სიგრძე: "))
side_2 = int(input("მეორე გვერდის სიგრძე: "))
side_3 = int(input("მესამე გვერდის სიგრძე: "))
P = int(side_1 + side_2 + side_3)
##სამკუთხედის ფართობის გამოსათვლელად გამოვიყენებთ ჰერონის ფორმულას, რომელიც ამბობს, რომ ფართობი ტოლია=კვადრატული ფესვი პერტიმეტირს ნახევარი გამრავლებული პერიმეტრის ნახევარს გამოკლებული პირველი გვერდი, კიდევ გამრავლებული პერიმეტრის ნახევარს გამოკლებული მეორე გვერდი და ანალოგიურად მესაზეც იგივეს ვიზამთ.)
area = math.sqrt(P * 0.5 *(P * 0.5 - side_1)*(P * 0.5 - side_2)*(P * 0.5 - side_3))
print(f"სამკუთხედის პერიმეტრია {P}")
print(f"სამკუთხედის ფართობი არის {area}")

